'''
순열 공식이 있나봄
lst[n] = lst[n-1]+lst[n-2]
이제 뭔지 배우러 가야지

조합으로 결과 쭉 나열 해놓고 결과 사이의 관계 찾아
1짜리 n, =짜리 m -> (n,m)
n=1: (1,0): 1
n=2: (2,0), (0,1): 1 + 1 = 2
n=3: (3,0), (1,1): 1 + 2C1 = 3
n=4: (4,0), (2,1), (0,2): 1 + 3C1 + 1 = 5
n=5: (5,0), (3,1), (1,2): 1 + 4C1 + 3C1 = 8

여기부터 묶어서 나열 필요
n=6: (6,0), (4,1), (2,2), (0,3): 1 + 5C1 + [3C2 + 3C1] + 1 = 13
...
'''

import sys
n = int(sys.stdin.readline())
lst=[0]*1001

lst[1]=1
lst[2]=2

for i in range(3, n+1):
    lst[i]=lst[i-1]+lst[i-2]

print(lst[n]%10007)